# SheetScale Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetScale Property
ParameterTypeId Class See Also
---
"Scale"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetScale { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetScale As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetScale {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace